package other;

/**
 * B序（未完成）
 * 时间限制：C/C++语言 1000MS；其他语言 3000MS
 * 内存限制：C/C++语言 65536KB；其他语言 589824KB
 * 题目描述：
 * 你有1-n共n个数字可以使用，每个数字的使用次数无限制，显然共有n^n个不同的长度为n的序列。其中所有不上升序列和不下降序列统称为B序，给定n，问长度同样为n的b序有多少个，因为结果比较大，请输出答案对1000000007取模之后的结果。
 *
 *        不上升序列：从序列第二个数字开始，均小于等于前一个数字。
 *
 *        不下降序列：从序列第二个数字开始，均大于等于前一个数字。
 *
 * 输入
 * 输入仅包含一个正整数n(1<=n<=10^5)。
 *
 * 输出描述
 *
 * 输出
 * 输出仅包含一个正整数，表示答案对1000000007取模的结果。
 *
 *
 * 样例输入
 * 2
 * 样例输出
 * 4
 *
 * Hint
 * 输入样例2
 * 3
 * 输出样例2
 * 17
 *
 * @author 刘壮飞
 * https://github.com/zfman.
 * https://blog.csdn.net/lzhuangfei.
 */
public class Baidu3 {
}
